from datetime import datetime
"""
Функція get_days_from_today розраховує кількість днів
між заданою датою і поточною датою.
"""

def get_days_from_today(date):
    try:
        conv_date = datetime.strptime(date, '%Y-%m-%d').date() #Задана дата переводиться до datetime об'єкту в форматі "РРРР-ММ-ДД"
        today_date = datetime.today().date() #Поточна дата в форматі "РРРР-ММ-ДД"
        total_date = conv_date - today_date #Різниця вказаної та поточної дати    
        return total_date.days #Повернення результату різниці    
    except:
        return 'Дата повинна бути у форматі "РРРР-ММ-ДД"' #Робимо виняток у разі некоректно введених даних

date_plus = '2026-02-01' #Задано дату, яка виводить результат з додатним числом
print(f'Різниця між поточною та заданою датами: {get_days_from_today(date_plus)} дня(і)')

date_minus = '2026-01-01' #Задано дату, яка виводить результат з від'ємним числом на неправильному написанні через "."
print(f'Різниця між поточною та заданою датами: {get_days_from_today(date_minus)} дня(і)')

date_error = '2026.02.10' #Задано дату, яка написана в неправильному форматі, в результаті чого виводить виняток
print(f'Різниця між поточною та заданою датами: {get_days_from_today(date_error)} дня(і)')